RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_ospi.h
/*!
    \file    gd32h77x_78x_ospi.h
    \brief   definitions for the OSPI

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_OSPI_H
#define GD32H77X_78X_OSPI_H

#include "gd32h77x_78x.h"

/* OSPI definitions */
#define OSPI0                             OSPI_BASE
#define OSPI1                             (OSPI_BASE + 0x00005000U)

/* registers definitions */
#define OSPI_CTL(ospix)                   REG32((ospix) + 0x00000000U)         /*!< OSPI control register */
#define OSPI_DCFG0(ospix)                 REG32((ospix) + 0x00000008U)         /*!< OSPI device configuration register */
#define OSPI_DCFG1(ospix)                 REG32((ospix) + 0x0000000CU)         /*!< OSPI device configuration register */
#define OSPI_DCFG3(ospix)                 REG32((ospix) + 0x00000014U)         /*!< OSPI device configuration register */
#define OSPI_STAT(ospix)                  REG32((ospix) + 0x00000020U)         /*!< OSPI status register */
#define OSPI_STATC(ospix)                 REG32((ospix) + 0x00000024U)         /*!< OSPI status clear register */
#define OSPI_DTLEN(ospix)                 REG32((ospix) + 0x00000040U)         /*!< OSPI data length register */
#define OSPI_ADDR(ospix)                  REG32((ospix) + 0x00000048U)         /*!< OSPI address register */
#define OSPI_DATA(ospix)                  REG32((ospix) + 0x00000050U)         /*!< OSPI data register */
#define OSPI_STATMK(ospix)                REG32((ospix) + 0x00000080U)         /*!< OSPI status mask register */
#define OSPI_STATMATCH(ospix)             REG32((ospix) + 0x00000088U)         /*!< OSPI status match register */
#define OSPI_INTERVAL(ospix)              REG32((ospix) + 0x00000090U)         /*!< OSPI interval register */
#define OSPI_TCFG(ospix)                  REG32((ospix) + 0x00000100U)         /*!< OSPI transfer configuration register */
#define OSPI_TIMCFG(ospix)                REG32((ospix) + 0x00000108U)         /*!< OSPI timing configuration register */
#define OSPI_INS(ospix)                   REG32((ospix) + 0x00000110U)         /*!< OSPI instruction register */
#define OSPI_ALTE(ospix)                  REG32((ospix) + 0x00000120U)         /*!< OSPI alternate bytes register */
#define OSPI_LPOUT(ospix)                 REG32((ospix) + 0x00000130U)         /*!< OSPI low-power timeout register */
#define OSPI_WPTCFG(ospix)                REG32((ospix) + 0x00000140U)         /*!< OSPI wrap transfer configuration register */
#define OSPI_WPTIMCFG(ospix)              REG32((ospix) + 0x00000148U)         /*!< OSPI wrap timing configuration register */
#define OSPI_WPINS(ospix)                 REG32((ospix) + 0x00000150U)         /*!< OSPI wrap instruction register */
#define OSPI_WPALTE(ospix)                REG32((ospix) + 0x00000160U)         /*!< OSPI wrap alternate bytes register */
#define OSPI_WTCFG(ospix)                 REG32((ospix) + 0x00000180U)         /*!< OSPI write transfer configuration register */
#define OSPI_WTIMCFG(ospix)               REG32((ospix) + 0x00000188U)         /*!< OSPI write timing configuration register */
#define OSPI_WINS(ospix)                  REG32((ospix) + 0x00000190U)         /*!< OSPI write instruction register */
#define OSPI_WALTE(ospix)                 REG32((ospix) + 0x000001A0U)         /*!< OSPI write alternate bytes register */
#define OSPI_HBLCFG(ospix)                REG32((ospix) + 0x00000200U)         /*!< OSPI hyperbus latency configuration register */

/* bits definitions */
/* OSPI_CTL */
#define OSPI_CTL_OSPIEN                   BIT(0)                               /*!< enable the OSPI */
#define OSPI_CTL_ABORT                    BIT(1)                               /*!< abort request */
#define OSPI_CTL_MDMAEN                   BIT(2)                               /*!< mdma enable */
#define OSPI_CTL_TMOUTEN                  BIT(3)                               /*!< timeout counter enable */
#define OSPI_CTL_DQSOEN                   BIT(5)                               /*!< DQS output enable */
#define OSPI_CTL_DQMOD                    BIT(6)                               /*!< dual-quad mode */
#define OSPI_CTL_DEVS                     BIT(7)                               /*!< flash select */
#define OSPI_CTL_FTL                      BITS(8,12)                           /*!< FIFO threshold level */
#define OSPI_CTL_TERRIE                   BIT(16)                              /*!< transfer error interrupt enable */
#define OSPI_CTL_TCIE                     BIT(17)                              /*!< transfer complete interrupt enable */
#define OSPI_CTL_FTIE                     BIT(18)                              /*!< FIFO threshold interrupt enable */
#define OSPI_CTL_SMIE                     BIT(19)                              /*!< status match interrupt enable */
#define OSPI_CTL_TMOUTIE                  BIT(20)                              /*!< timeout interrupt enable */
#define OSPI_CTL_RCKDVMUX                 BIT(21)                              /*!< receive clock delay chain enable */
#define OSPI_CTL_SPS                      BIT(22)                              /*!< status polling mode stop */
#define OSPI_CTL_SPMOD                    BIT(23)                              /*!< status polling match mode */
#define OSPI_CTL_RCKDV                    BITS(24,27)                          /*!< receive clock delay value */
#define OSPI_CTL_FMOD                     BITS(28,29)                          /*!< functional mode select */

/* OSPI_DCFG0 */
#define OSPI_DCFG0_FRCK                   BIT(1)                               /*!< free running clock */
#define OSPI_DCFG0_RSCKDEN                BIT(3)                               /*!< enable sample delay */
#define OSPI_DCFG0_RXSFT                  BITS(4,6)                            /*!< shift receive step if receive data delay more than 0.5 cycle */
#define OSPI_DCFG0_CSHC                   BITS(8,13)                           /*!< chip select high cycle */
#define OSPI_DCFG0_MESZ                   BITS(16,20)                          /*!< memory size */
#define OSPI_DCFG0_DTYSEL                 BITS(24,26)                          /*!< select device type */
#define OSPI_DCFG0_RCKADD                 BIT(31)                              /*!< DQS receive add 1 cycle */

/* OSPI_DCFG1 */
#define OSPI_DCFG1_PSC                    BITS(0,7)                            /*!< prescaler set */
#define OSPI_DCFG1_CSNADD                 BIT(8)                               /*!< CSN add 1/2 cycle */
#define OSPI_DCFG1_DQSODVEN               BIT(9)                               /*!< DQS out transfer clock delay enable */
#define OSPI_DCFG1_TCKDVEN                BIT(10)                              /*!< SCK transfer clock delay enable */
#define OSPI_DCFG1_TCKDV                  BITS(12,15)                          /*!< SCK transfer clock delay chain value */
#define OSPI_DCFG1_DQSODV                 BITS(28,31)                          /*!< DQS out transfer clock delay chain value */

