RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_ospi.h
    uint32_t ins_dtr_mode;                                                     /*!< it enables or not the DTR mode for the instruction phase. */

    uint32_t address;                                                          /*!< it contains the address to be sent to the device.
                                                                                    this parameter can be a value between 0 and 0xFFFFFFFF */
    uint32_t addr_mode;                                                        /*!< it indicates the mode of the address. */

    uint32_t addr_size;                                                        /*!< it indicates the size of the address. */

    uint32_t addr_dtr_mode;                                                    /*!< it enables or not the DTR mode for the address phase. */

    uint32_t alter_bytes;                                                      /*!< it contains the alternate bytes to be sent to the device.
                                                                                    this parameter can be a value between 0 and 0xFFFFFFFF */
    uint32_t alter_bytes_mode;                                                 /*!< it indicates the mode of the alternate bytes. */

    uint32_t alter_bytes_size;                                                 /*!< it indicates the size of the alternate bytes. */

    uint32_t alter_bytes_dtr_mode;                                             /*!< it enables or not the DTR mode for the alternate bytes phase. */

    uint32_t data_mode;                                                        /*!< it indicates the mode of the data. */

    uint32_t nbdata;                                                           /*!< it indicates the number of data transferred with this command.
                                                                                    this field is only used for indirect mode.
                                                                                    this parameter can be a value between 1 and 0xFFFFFFFF */
    uint32_t data_dtr_mode;                                                    /*!< it enables or not the DTR mode for the data phase. */

    uint32_t dummy_cycles;                                                     /*!< it indicates the number of dummy cycles inserted before data phase.
                                                                                    this parameter can be a value between 0 and 31 */
    uint32_t dqs_mode;                                                         /*!< it enables or not the data strobe management. */

    uint32_t sioo_mode;                                                        /*!< it enables or not the sioo mode. */

} ospi_regular_cmd_struct;

/* ospi hyperbus configuration struct definitions */
typedef struct {
    uint32_t rw_recovery_time;                                                 /*!< it indicates the number of cycles for the device read write recovery time.
                                                                                    this parameter can be a value between 0 and 255 */
    uint32_t access_time;                                                      /*!< it indicates the number of cycles for the device access time.
                                                                                    this parameter can be a value between 0 and 255 */
    uint32_t write_zero_latency;                                               /*!< it enables or not the latency for the write access. */

    uint32_t latency_mode;                                                     /*!< it configures the latency mode. */

} ospi_hyperbus_cfg_struct;

/* ospi hyperbus command struct definitions */
typedef struct {
    uint32_t addr_space;                                                       /*!< it indicates the address space accessed by the command. */

    uint32_t address;                                                          /*!< it contains the address to be sent tot he device.
                                                                                    this parameter can be a value between 0 and 0xFFFFFFFF */
    uint32_t addr_size;                                                        /*!< it indicates the size of the address. */

    uint32_t nbdata;                                                           /*!< it indicates the number of data transferred with this command.
                                                                                    this field is only used for indirect mode.
                                                                                    this parameter can be a value between 1 and 0xFFFFFFFF
                                                                                    in case of autopolling mode, this parameter can be any value between 1 and 4 */
    uint32_t dqs_mode;                                                         /*!< it enables or not the data strobe management. */

} ospi_hyperbus_cmd_struct;


/* ospi autopolling struct definitions */
typedef struct {
    uint32_t match;                                                            /*!< specifies the value to be compared with the masked status register to get a match.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t mask;                                                             /*!< specifies the mask to be applied to the status bytes received.
                                                                                    this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t interval;                                                         /*!< specifies the number of clock cycles between two read during automatic polling phases.
                                                                                    this parameter can be any value between 0 and 0xFFFF */
    uint32_t match_mode;                                                       /*!< specifies the method used for determining a match. */

    uint32_t automatic_stop;                                                   /*!< specifies if automatic polling is stopped after a match. */

} ospi_autopolling_struct;

/* ospi memory mapped struct definitions */
typedef struct {
    uint32_t timeout_activation;                                               /*!< specifies if the timeout counter is enabled to release the chip select. */

