RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_ospi.h
/* OSPI sample shift(more than 1/2) */
#define DCFG0_SSAMPLE(regval)             (BITS(4,6) & ((uint32_t)(regval) << 4))
#define OSPI_SHIFTING_NONE                DCFG0_SSAMPLE(0)                     /*!< no shift when sample data */
#define OSPI_SHIFTING_1_CYCLE             DCFG0_SSAMPLE(1)                     /*!< 1 SCK cycle shift when sample data */
#define OSPI_SHIFTING_2_CYCLE             DCFG0_SSAMPLE(2)                     /*!< 2 SCK cycle shift when sample data */
#define OSPI_SHIFTING_3_CYCLE             DCFG0_SSAMPLE(3)                     /*!< 3 SCK cycle shift when sample data */
#define OSPI_SHIFTING_4_CYCLE             DCFG0_SSAMPLE(4)                     /*!< 4 SCK cycle shift when sample data */
#define OSPI_SHIFTING_5_CYCLE             DCFG0_SSAMPLE(5)                     /*!< 5 SCK cycle shift when sample data */
#define OSPI_SHIFTING_6_CYCLE             DCFG0_SSAMPLE(6)                     /*!< 6 SCK cycle shift when sample data */
#define OSPI_SHIFTING_7_CYCLE             DCFG0_SSAMPLE(7)                     /*!< 7 SCK cycle shift when sample data */

/* hyperbus configuration */
/* latency mode */
#define OSPI_VAR_INIT_LATENCY             ((uint32_t)0x00000000U)              /*!< variable initial latency mode */
#define OSPI_FIXED_LATENCY                OSPI_HBLCFG_LMOD                     /*!< fixed latency mode */

/* write zero latency */
#define OSPI_WRITE_ZERO_LATENCY_DISABLE   ((uint32_t)0x00000000U)              /*!< write operation zero latency disable */
#define OSPI_WRITE_ZERO_LATENCY_ENABLE    OSPI_HBLCFG_WZLAT                    /*!< write operation zero latency enable */

/* access time */
#define OSPI_ACCTM(regval)                (BITS(8,15) & ((uint32_t)(regval) << 8U))

/* read write recovery time */
#define OSPI_RWRTM(regval)                (BITS(16,23) & ((uint32_t)(regval) << 16U))

/* select address space */
#define OSPI_MEMORY_ADDRESS_SPACE         OSPI_HYPERBUS_MEMORY_MODE            /*!< select memory address space */
#define OSPI_REGISTER_ADDRESS_SPACE       OSPI_HYPERBUS_REGISTER_MODE          /*!< select register address space */

/* OSPI interrupt enable/disable constants definitions */
#define OSPI_INT_TERR                     OSPI_CTL_TERRIE                      /*!< transfer error interrupt enable */
#define OSPI_INT_TC                       OSPI_CTL_TCIE                        /*!< transfer complete interrupt enable */
#define OSPI_INT_FT                       OSPI_CTL_FTIE                        /*!< FIFO threshold interrupt enable */
#define OSPI_INT_SM                       OSPI_CTL_SMIE                        /*!< status match interrupt enable */
#define OSPI_INT_TMOUT                    OSPI_CTL_TMOUTIE                     /*!< timeout interrupt enable */

/* OSPI interrupt flag constants definitions */
#define OSPI_INT_FLAG_TERR                ((uint8_t)0x00U)                     /*!< transfer error interrupt flag */
#define OSPI_INT_FLAG_TC                  ((uint8_t)0x01U)                     /*!< transfer complete interrupt flag */
#define OSPI_INT_FLAG_FT                  ((uint8_t)0x02U)                     /*!< FIFO threshold interrupt flag */
#define OSPI_INT_FLAG_SM                  ((uint8_t)0x03U)                     /*!< status match interrupt flag */
#define OSPI_INT_FLAG_TMOUT               ((uint8_t)0x04U)                     /*!< timeout interrupt flag */

/* OSPI flag definitions */
#define OSPI_FLAG_TERR                    OSPI_STAT_TERR                       /*!< transfer error flag */
#define OSPI_FLAG_TC                      OSPI_STAT_TC                         /*!< transfer complete flag */
#define OSPI_FLAG_FT                      OSPI_STAT_FT                         /*!< FIFO threshold flag */
#define OSPI_FLAG_SM                      OSPI_STAT_SM                         /*!< status match flag */
#define OSPI_FLAG_TMOUT                   OSPI_STAT_TMOUT                      /*!< timeout flag */
#define OSPI_FLAG_BUSY                    OSPI_STAT_BUSY                       /*!< busy flag */

/* function declarations */
/* initialization functions */
/* reset OSPI */
void ospi_deinit(uint32_t ospi_periph);
/* initialize the parameters of OSPI struct with the default values */
void ospi_struct_init(ospi_parameter_struct *ospi_struct);
/* initialize OSPI parameter */
void ospi_init(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct);
/* enable OSPI */
void ospi_enable(uint32_t ospi_periph);
/* disable OSPI */
void ospi_disable(uint32_t ospi_periph);

/* device configure functions */
/* select device */
void ospi_device_select(uint32_t ospi_periph, uint32_t deviceid);
/* configure device memory type */
void ospi_device_memory_type_config(uint32_t ospi_periph, uint32_t dtysel);
/* configure device memory size */
void ospi_device_memory_size_config(uint32_t ospi_periph, uint32_t mesz);

/* functional mode functions */
/* select functional mode */
void ospi_functional_mode_config(uint32_t ospi_periph, uint32_t fmod);
/* configure status polling mode */
void ospi_status_polling_config(uint32_t ospi_periph, uint32_t stop, uint32_t mode);
/* configure status mask */
void ospi_status_mask_config(uint32_t ospi_periph, uint32_t mask);
/* configure status match */
void ospi_status_match_config(uint32_t ospi_periph, uint32_t match);
/* configure interval cycle */
void ospi_interval_cycle_config(uint32_t ospi_periph, uint16_t interval);
/* configure timeout cycle */
void ospi_timeout_cycle_config(uint32_t ospi_periph, uint16_t timeout);

/* OSPI mode functions */
/* enable OSPI timeout counter */
void ospi_timeout_enable(uint32_t ospi_periph);
/* disable OSPI timeout counter */
void ospi_timeout_disable(uint32_t ospi_periph);
/* enable OSPI dual-quad mode */
void ospi_dual_quad_mode_enable(uint32_t ospi_periph);
/* disable OSPI dual-quad mode */
void ospi_dual_quad_mode_disable(uint32_t ospi_periph);
/* configure OSPI FIFO threshold level */
void ospi_fifo_level_config(uint32_t ospi_periph, uint32_t ftl);
/* enable clock free running when OSPI is free */
void ospi_free_clk_run_enable(uint32_t ospi_periph);
/* disable clock free running when OSPI is free */
void ospi_free_clk_run_disable(uint32_t ospi_periph);
/* configure chip select high cycle */
void ospi_chip_select_high_cycle_config(uint32_t ospi_periph, uint32_t cshc);
/* configure OSPI prescaler */
void ospi_prescaler_config(uint32_t ospi_periph, uint32_t psc);
/* configure refresh rate */
void ospi_refresh_config(uint32_t ospi_periph, uint32_t refrate);
/* enable OSPI DQS mode */
void ospi_dqs_mode_enable(uint32_t ospi_periph);
/* disable OSPI DQS mode */
void ospi_dqs_mode_disable(uint32_t ospi_periph);
/* configure send instruction only once mode */
void ospi_send_instruction_mode_config(uint32_t ospi_periph, uint32_t sioo);
/* configure dummy cycles number */
void ospi_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc);
/* configure delay hold 1/4 cycle */
void ospi_delay_hold_cycle_config(uint32_t ospi_periph, uint32_t dehqc);
/* configure sample shift */
void ospi_sample_shift_config(uint32_t ospi_periph, uint32_t ssample);
/* configure sample shift2 */
void ospi_sample_shift2_config(uint32_t ospi_periph, uint32_t sample_shift2);
/* enable OSPI receive delay block */
void ospi_receive_delay_block_enable(uint32_t ospi_periph);
/* disable OSPI receive delay block */
void ospi_receive_delay_block_disable(uint32_t ospi_periph);
/* enable OSPI CSN add 1/2 cycle mode */
void ospi_csn_add_enable(uint32_t ospi_periph);
/* disable OSPI CSN add 1/2 cycle mode */
void ospi_csn_add_disable(uint32_t ospi_periph);
/* enable OSPI DQS rck add mode */
void ospi_dqs_rck_add_enable(uint32_t ospi_periph);
/* disable OSPI DQS rck add mode */
void ospi_dqs_rck_add_disable(uint32_t ospi_periph);
/* enable OSPI DQS output mode */
void ospi_dqs_output_enable(uint32_t ospi_periph);
/* disable OSPI DQS output mode */
void ospi_dqs_output_disable(uint32_t ospi_periph);
/* configure DQS output delay chain */
void ospi_dqs_output_delay_chain_config(uint32_t ospi_periph, uint32_t delay);
/* enable OSPI DQS output delay chain */
void ospi_dqs_output_delay_chain_enable(uint32_t ospi_periph);
/* disable OSPI DQS output delay chain */
void ospi_dqs_output_delay_chain_disable(uint32_t ospi_periph);
/* configure OSPI transmit clock delay chain */
void ospi_tck_delay_chain_config(uint32_t ospi_periph, uint32_t delay);
/* enable OSPI OSPI transmit clock delay chain */
void ospi_tck_delay_chain_enable(uint32_t ospi_periph);
/* disable OSPI OSPI transmit clock delay chain */
void ospi_tck_delay_chain_disable(uint32_t ospi_periph);
/* configure OSPI receive clock delay chain */
void ospi_rck_delay_chain_config(uint32_t ospi_periph, uint32_t delay);
/* select OSPI receive SCK delay chain */
void ospi_receive_sck_delay_chain_select(uint32_t ospi_periph);
/* select CPDM delay */
void ospi_cpdm_delay_select(uint32_t ospi_periph);

/* OSPI transfer configure functions */
/* configure data length */
void ospi_data_length_config(uint32_t ospi_periph, uint32_t dtlen);
/* configure instruction mode */
void ospi_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction);
/* configure address mode */
void ospi_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr);
/* configure alternate bytes mode */
void ospi_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte);
/* configure data mode */
void ospi_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr);
/* OSPI transmit data */
void ospi_data_transmit(uint32_t ospi_periph, uint32_t data);
/* OSPI receive data */
uint32_t ospi_data_receive(uint32_t ospi_periph);

/* OSPI DMA functions */
/* enable OSPI MDMA */
void ospi_mdma_enable(uint32_t ospi_periph);
/* disable OSPI MDMA */
void ospi_mdma_disable(uint32_t ospi_periph);

